/*int a;
int b;
int c;

Console.Write("Введите первое число: ");
string number1 = Console.ReadLine()!;
int. TryParse(number1, out a);

Console.Write("Введите второе число: ");
string number2 = Console.ReadLine()!;
int. TryParse(number2, out b);

Console.Write("Введите третье число: ");
string number3 = Console.ReadLine()!;
int. TryParse(number3, out c);
*/

/*?*Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
*/

int N;
Console.Write($"Введите число: ");
int.TryParse(Console.ReadLine()!, out N);


for (N%2==0,)


 