/* Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.*/
int num;

Console.Write($"Введите число: ");
string num = Console.ReadLine()!;

if (num<99)
{Console.Write($"Такой цифры нет");}
else
{Console.Write($"Цифра = {number[2]}");}
